docs/verification/mutations/ir__cmd_interpolate__property_tests__scanner_agrees_with_independent_specification.patch
diff --git a/src/ir/cmd_interpolate/substitution.rs b/src/ir/cmd_interpolate/substitution.rs
--- a/src/ir/cmd_interpolate/substitution.rs
+++ b/src/ir/cmd_interpolate/substitution.rs
@@ -56,5 +56,5 @@ impl<'template, 'bindings> SubstitutionTraversal<'template, 'bindings> {
         let substitution =
             find_substitution(self.chars, pos, &self.bindings.ins, &self.bindings.outs);
-        if self.in_backticks {
+        if false && self.in_backticks {
             return self.append_protected_character(pos, ch, substitution);
         }
         Ok(self.append_unprotected_character(pos, ch, substitution))
