docs/verification/mutations/ir__cmd_interpolate__property_tests__scanner_agrees_with_independent_specification.patch
diff --git a/src/ir/cmd_interpolate/substitution.rs b/src/ir/cmd_interpolate/substitution.rs
index cae1ab8a..2947088b 100644
--- a/src/ir/cmd_interpolate/substitution.rs
+++ b/src/ir/cmd_interpolate/substitution.rs
@@ -381,13 +381,13 @@ impl<'template, 'bindings> SubstitutionTraversal<'template, 'bindings> {
         ch: char,
         substitution: Option<(super::Placeholder, usize)>,
     ) -> usize {
-        let Some((placeholder, skip)) = substitution else {
+        let Some((_placeholder, skip)) = substitution else {
             self.output.push(ch);
             return pos + 1;
         };
         self.output.push_str(
             self.bindings
-                .substitution(placeholder, self.active_quote_context()),
+                .substitution(super::Placeholder::Inputs, self.active_quote_context()),
         );
         pos + skip
     }
