docs/verification/mutations/ir__cmd_interpolate__property_tests__substituted_odd_backticks_are_rejected.patch
diff --git a/src/ir/cmd_interpolate/mod.rs b/src/ir/cmd_interpolate/mod.rs
--- a/src/ir/cmd_interpolate/mod.rs
+++ b/src/ir/cmd_interpolate/mod.rs
@@ -94,2 +94,2 @@ fn has_unmatched_backticks(s: &str) -> bool {
-    s.chars().filter(|&c| c == '`').count().rem_euclid(2) != 0
+    s.chars().filter(|&c| c == '`').count().rem_euclid(2) == 0
 }
