docs/verification/mutations/ir__cmd_interpolate__verification__marker_token_match_is_exact.patch
diff --git a/src/ir/cmd_interpolate/mod.rs b/src/ir/cmd_interpolate/mod.rs
--- a/src/ir/cmd_interpolate/mod.rs
+++ b/src/ir/cmd_interpolate/mod.rs
@@ -254,6 +254,6 @@ fn try_match_token<'a>(
     let mut matched_len = 0;
     for (i, token_ch) in token.chars().enumerate() {
-        if chars.get(pos + i) != Some(&token_ch) {
+        if chars.get(pos) != Some(&token_ch) {
             return None;
         }
         matched_len += 1;
