docs/verification/mutations/ir__cmd_interpolate__verification__sigil_placeholder_match_is_exact.patch
diff --git a/src/ir/cmd_interpolate.rs b/src/ir/cmd_interpolate.rs
--- a/src/ir/cmd_interpolate.rs
+++ b/src/ir/cmd_interpolate.rs
@@ -164,5 +164,5 @@ fn has_valid_word_boundaries(chars: &[char], pos: usize, len: usize) -> bool {
     let next_ok = chars
         .get(pos + len + 1)
         .is_none_or(|c| !is_identifier_char(*c));
-    prev_ok && next_ok
+    prev_ok
 }
