docs/verification/mutations/ir__cycle__verification__canonicalize_four_node_cycle_is_canonical.patch
diff --git a/src/ir/cycle_support.rs b/src/ir/cycle_support.rs
index 59012331..fdd314ed 100644
--- a/src/ir/cycle_support.rs
+++ b/src/ir/cycle_support.rs
@@ -118,7 +118,8 @@ pub(super) fn compare_cycle_paths(left: &Utf8PathBuf, right: &Utf8PathBuf) -> Or
 /// Rotate `offset` forward from `start` within a cycle of length `len`.
 pub(super) const fn rotate_index(start: usize, offset: usize, len: usize) -> usize {
     let index = start + offset;
-    if index >= len { index - len } else { index }
+    let _ = len;
+    index
 }
 
 /// Look up the visit state recorded for `path`.
