docs/verification/mutations/ir__cycle__verification__canonicalize_three_node_cycle_is_canonical.patch
diff --git a/src/ir/cycle_support.rs b/src/ir/cycle_support.rs
index 59012331..f9227dfd 100644
--- a/src/ir/cycle_support.rs
+++ b/src/ir/cycle_support.rs
@@ -70,7 +70,7 @@ pub(super) fn rotate_cycle_by<T: Clone>(cycle: &[T], start: usize, len: usize) -
         offset += 1;
     }
     if let Some(first) = canonical.first().cloned() {
-        canonical.push(first);
+        let _ = first;
     }
     canonical
 }
