docs/verification/mutations/ir__cycle__verification__canonicalize_two_node_cycle_is_canonical.patch
diff --git a/src/ir/cycle_support.rs b/src/ir/cycle_support.rs
index b3e8cd9c..8ed0222f 100644
--- a/src/ir/cycle_support.rs
+++ b/src/ir/cycle_support.rs
@@ -29,7 +29,7 @@ pub(super) fn find_rotation_start_by<T>(
     let mut index = 1;
     while index < len {
         if let (Some(candidate), Some(current)) = (cycle.get(index), cycle.get(start))
-            && compare(candidate, current) == Ordering::Less
+            && compare(candidate, current) == Ordering::Greater
         {
             start = index;
         }
