docs/verification/mutations/ir__cycle__verification__self_dependency_reports_cycle.patch
diff --git a/src/ir/cycle_detector.rs b/src/ir/cycle_detector.rs
index 2de8038d..64ee7157 100644
--- a/src/ir/cycle_detector.rs
+++ b/src/ir/cycle_detector.rs
@@ -49,7 +49,7 @@ pub(super) enum CycleVisitResult {
 impl CycleVisitResult {
     /// Return whether the result carries a detected cycle.
     const fn is_cycle(&self) -> bool {
-        !matches!(self, Self::None)
+        matches!(self, Self::Path(_))
     }
 
     /// Convert a path-carrying result into its cycle, if any.
