docs/verification/mutations/ir__cycle__verification__transitive_missing_dependency_does_not_report_cycle.patch
diff --git a/src/ir/cycle_detector.rs b/src/ir/cycle_detector.rs
index a08fe7b9..61b6989f 100644
--- a/src/ir/cycle_detector.rs
+++ b/src/ir/cycle_detector.rs
@@ -343,7 +343,11 @@ impl<'targets> CycleDetector<'targets> {
             if matches!(search, CycleSearch::Path) {
                 self.record_missing_dependency(node, dep);
             }
-            return CycleVisitResult::None;
+            return match search {
+                #[cfg(kani)]
+                CycleSearch::Presence => CycleVisitResult::Present,
+                CycleSearch::Path => CycleVisitResult::None,
+            };
         };
 
         self.visit(target, search)
