docs/verification/mutations/ir__from_manifest__verification__empty_rule_shape_is_rejected.patch
diff --git a/src/ir/from_manifest_support.rs b/src/ir/from_manifest_support.rs
index f1337074..88aa7d87 100644
--- a/src/ir/from_manifest_support.rs
+++ b/src/ir/from_manifest_support.rs
@@ -254,8 +254,9 @@ pub(super) fn resolve_rule(
 
 /// Build the empty-rule error for a target that selected no rule.
 fn empty_rule_error(target_name: &str) -> IrGenError {
-    IrGenError::EmptyRule {
+    IrGenError::RuleNotFound {
         target_name: target_name.to_owned(),
+        rule_name: target_name.to_owned(),
         message: empty_rule_message(target_name),
     }
 }
