docs/verification/mutations/ir__from_manifest__verification__multiple_rule_shape_is_rejected.patch
diff --git a/src/ir/from_manifest_support.rs b/src/ir/from_manifest_support.rs
index 04cc1ec0..c5fab949 100644
--- a/src/ir/from_manifest_support.rs
+++ b/src/ir/from_manifest_support.rs
@@ -202,7 +202,6 @@ pub(super) fn resolve_rule(
             if rules.is_empty() {
                 Err(empty_rule_error(target_name))
             } else {
-                sort_utils::sort_strings(&mut rules);
                 Err(multiple_rules_error(target_name, rules))
             }
         },
