docs/verification/mutations/ir__from_manifest__verification__multiple_rule_shape_is_rejected.patch
diff --git a/src/ir/sort_utils.rs b/src/ir/sort_utils.rs
index 552c5606..80bc65d9 100644
--- a/src/ir/sort_utils.rs
+++ b/src/ir/sort_utils.rs
@@ -44,7 +44,7 @@ where
 pub(super) fn sort_strings(values: &mut [String]) {
     // The closure is not redundant: `string_cmp` takes `&str`, and passing
     // the fn item would not satisfy the `Fn(&String, &String)` bound.
-    insertion_sort_by(values, |a, b| string_cmp(a, b));
+    insertion_sort_by(values, |a, b| string_cmp(b, a));
 }
 
 /// Order two strings for deterministic rule-name sorting.
